<NUK>
<SPL>
<PAD>
 
e
t
n
a
o
r
s
l
,
d
c
h
u
p
.
(
f
)
g
b
m
"
y
R
v
F
w
L
T
S


<SPL>
;
{
E
k
A
the
1
C
x
O
D
>
P
<
J
=
B
N
2
M
3
0
to
4
5
G
:
U
9
8
6
7
-
public
W
}
V
_
is
/
@
if
for
of
class
new
String
in
H
j
X
void
'
+
K
file
entry
z
This
method
this
that
be
private
entries
Y
!
it
on
return
q
null
The
not
*
List
get
static
from
all
Auto
generated
we
stub
{@link
BibEntry
given
final
as
extends
type
[
field
dialog
]
are
set
will
an
TODO
with
We
so
default
boolean
list
selected
name
#
database
user
icon
used
files
Globals
current
Localization
should
\
Optional
prefs
?
Jab
Set
by
add
value
Ref
text
If
int
open
Add
has
there
changes
create
content
implements
change
&
Q
one
search
no
preferences
when
any
try
have
MaterialDesignIcon
empty
Path
can
group
css
key
Bib
keys
lang
put
up
action
import
false
use
task
which
Entry
into
format
menu
Field
It
only
command
Check
panel
need
first
Create
after
tab
|
display
string
URL
actions
Remove
node
undo
Group
title
->
abbreviation
fields
called
isEmpty
found
directory
abstract
Returns
component
based
Undoable
All
File
do
View
interface
update
==
each
context
children
FX
editor
message
application
already
remove
row
event
true
values
BackgroundTask
version
information
changed
JabRefPreferences
throws
view
Java
Collection
removed
was
url
root
specified
case
also
property
their
Map
!=
at
::
before
link
non
error
does
path
show
been
Exception
exception
currently
check
ExternalFileType
Text
@param
visible
provides
shown
reference
suggestion
Action
GUI
style
protected
stream
map
citation
LOGGER
Get
page
displayed
SimpleCommand
some
auto
save
citations
work
doesn't
using
ParserResult
prevent
button
types
left
make
thread
model
different
markers
result
since
debug
base
but
Class
clipboard
them
Update
To
pr
lang("
insert
Actions
just
stored
returns
external
access
Opens
character
Panel
otherwise
table
tabs
marker
Icon
out
linked
For
number
query
Editor
abbreviations
contains
binding
Preferences
modified
source
Creates
||
Z
include
errors
time
data
position
Override
its
background
Open
org
IOException
here
placeholder
done
Callback
array
Shows
objects
other
cite
methods
then
two
must
runs
always
invoked
Sets
exporter
TextField
same
build
output
&&
Object
confirmation
Table
loaded
arguments
code
available
""
layout
Office
databases
Base
size
according
databaseContext
defined
Future
until
sure
Windows
needs
Dialog
around
correctly
could
Node
journal
whether
added
delete
frame
item
indicate
nothing
Do
GroupTreeNode
NamedCompound
SearchQuery
paste
possible
https
cell
else
directly
line
BasePanel
TABLE_ICONS
Model
scene
javafx
%
blue
drivers
JDBC
Oracle
real
mocking
listener
selection
Frame
pane
See
state
dialogService
parent
main
XComponentContext
completion
Read
Use
filename
In
without
document
order
tree
groups
proper
wrap
shows
correct
toString
Find
Entries
Store
Constructs
ArrayList
progress
represents
run
start
switch
find
MenuItem
loader
getDatabase
old
getSelectedEntries
suffix
Te
drop
instance
length
(or
No
StandardField
browser
operation
valid
more
instead
{@code
Observable
track
copy
buttons
Preview
focus
folder
disk
Tree
opened
exists
Tip
Tool
input
Menu
question
JabRefDialogService
mainTable
copying
initialized
FIXME
java
VBox
allowed
displaying
Collect
graphic
undoManager
soon
status
showErrorDialogAndWait
Input
Only
dialogs
Task
instances
titles
First
appearance
updates
When
target
look
execute
following
extension
getField
they
Swing
components
jabref
++
Key
Function
office
either
options
while
General
setting
Need
addListener
representing
instanceof
modifier
preview
wait
AbstractUndoableJabRefEdit
Supplier
mode
ClipboardContent
provider
Run
about
label
Exporter
width
BaseDialog
associated
generic
actual
Deprecated
focused
SuggestionProvider
" '"
"Copied"
notify
had
original
adding
Save
names
calls
OK
way
both
isPresent
basePanel
ObservableList
registered
contents
export
included
toRemove
wants
date
SpecialField
ContextMenu
control
taken
alert
dismissed
Dialog}
"'."
shortenDialogMessage
bibDatabaseContext
bibEntry
requires
showConfirmationDialogAndWait
Move
members
Register
active
logic
Task}
last
SpecialFieldViewModel
Text(
HBox
running
gives
system
getText
commandPath
Return
Format
Try
because
top
fix
reason
SuppressWarnings
Insert
crossref
initial
executed
connection
where
happen
may
split
bar
queryInterface
UnoRuntime
XTextContent
stateManager
argumentProcessor
merged
even
can't
implementation
cited
BibDatabase
getGroup
ensure
marks
collection
equal
filePath
Bootstraps
Runs
entry's
simple
required
Callable
http
reset
cannot
specific
term
gui
package
write
Print
refresh
everything
ugly
right
getValue
reflective
Gets
System
getBoolean
(c)
BibDatabaseContext
initialize
function
Side
anything
don't
"Mode LINK"
resource
converter
bunch
Cell}
trim
opening
Show
relevant
SEARCH
TextInputControl
exist
break
move
checks
bibtex
warn
through
matches
like
deleted
previous
Puts
Void
BIB
unknown
Search
custom
ExternalFileTypes
ce
win
bindings
Revert
object
bind
equals
Listener
Abbreviation
Method
Log
font
sort
chosen
another
complete
want
column
memEntry
provided
Files
simply
via
close
textArea
fileDialogConfiguration
FileDialogConfiguration
cancel
okButtonLabel
bes
showing
providers
$
characters
assigned
completer
space
fetcher
Pane
SuggestionProviders
Worker
createInitialComponentContext
NEWLINE
NODE
registerListener
@return
injection
live
Window
filenames
iterator
essentially
undo/redo
Look
links
divider
saves
DialogService
Background
XNamed
Open")
constructor
let's
append
depending
defaultPat
managing
image
attempted
plugin
formatName
select
checkbox
StackPane
every
most
popup
uniquefiers
request
Boolean
throw
takes
example
Nothing
ArgumentProcessor
getName
selects
between
KeyBindingRepository
ScrollPane
take
passed
Undo
reflection
UndoableEdit
support
keywords
generation
bib
activate
xImpLoader
xSet
log4j
setDisable
defines
factory
copies
m_subtreeBackup
storing
call
expand
mark
GroupNodeViewModel
enum
store
edited
Type
send
elements
automatically
BorderPane
refKeys
enter
InternalField
edit
Button
After
Checks
wrapper
tasks
wrapped
inside
toAbsolutePath
On
saved
callable
Executes
oracle
Replace
Redo
monadic
EasyBind
long
wraps
warning
Abstract
Updates
autocompleter
reserved
rights
Copyright
finished
click
viewer
Represents
viewModel
Comparator
TableView
global
Currently
parameters
circle
controlsfx
Action}
Generate
HashMap
Alt
see
created
thus
info
location
toggle
Component
newValue
observable
Assignment
Warn
(!
side
isSelected
catch
AbbreviationViewModel
editing
handles
replace
setValue
server
means
Change
results
than
over
DB
textInputControl
items
Application
NULL
dir
String()
setValues
app
next
bookmark
tmpEntry
memory
imports
Ok
OOBibBase
xChildNamed
stringConverter
setText
handler
FileNodeWrapper
CheckBoxTreeItem
PDF
matched
OOBibStyle
our
Content
Label
makes
exporters
remote
Image
duplicate
cleared
getCurrentBasePanel
pseudo
permutation
JabRefFrame
parserResult
warnings
existing
references
drag
end
canceled
newGroups
Adds
KeyBinding
containing
settings
searchQuery
oldValue
100
duplicates
EntryEditorTab
single
orElse
kept
cut
AutoCompleteSuggestionProvider
JabRefGUI
Copies
suggestions
selector
Mode
compareEntriesStrictly
DuplicateCheck
mem
getBibDatabaseContext
getGroupNode
Modify
failed
Runnable
tmp
read
temporary
jar
parameter
Should
EntryType
really
Ask
BindingsHelper
Value
underlying
getDialogPane
16
GUIGlobals
RemoteListenerServerLifecycle
dependency
startup
upon
bibTexTitlePane
job
showConfirmationDialogWithOptOutAndWait
YES
Throwable
causing
createDependency
dependencies
CoarseChangeFilter
addSelectionListener
StringReader
came
BasePanelMode
Ensures
currentSearchQuery
searches
Number
SearchAutoCompleteListener
bug
latest
signals
newBase
"bib"
cli
web
println
usage
jdbc
"Journal Title 500"
Reuse
delay
params
Locale
"\""
implemented
insertEntry
UndoableInsertEntry
XFootnote
setAutomaticFields
UpdateField
asked
resolve
ToggleGroup
DOI
weak
getSuggestionProviders
Other
markingContent
ControlsFxVisualizer
async
WEB
"Entry editor, previous panel 2"
initialization
>=
lead
typeRadioButtons
Import
"ONLY
Current
did
were
closed
Settings
archive
clazz
Switch
within
Panel()
inMem
newField
configurable
article
jointFields
Refresh
creating
help
context_entries
inserted
manager
service
annotation
Sort
Generates
sConnect
newline
defaultChoice
choice
allows
REMOVE
importer
padding
Font
Util
getUndoManager
tests
know
removal
prefix
Pass
reloading
Installs
customization
Bottom
releases
Different
he
Graphics
Automatically
uniq
fetch
images
listing
ifPresent
getEntries
State
variable
fieldName
requestFocus
Focuses
openFile
concerned
SidePaneType
clear
redo
ChangeListener
during
acceptable
matching
Even
clearDatabaseFile
getDatabaseContext
generate
second
getDefaultExternalFileTypes
fileType
BaseAction
CopyBibTeXKeyAndLinkAction
Tag
tag
Edit(new
marked
PRIORITY
URL")
down
onFinished
FILE_EXCEL
RemoteClient
Named
showInformationDialogAndWait
italicize
Put
Changes
sb
description
keybinding
CustomExternalFileType
AbbreviationsFileViewModel
lists
internal
unless
<p>
Autosave
threads
SelectionMode
setSelectionMode
getSelectionModel
unbind
graphicProperty
lp
footer
range
jurt
isDirectory
DecorationPane
leading
"unchecked"
handle
valToMove
Bindings
checked
Match()
Stream
perform
MutableLogEvent
Will
Boolean(
Desired
Manager}
related
INSTANCE
JabRefExecutorService
600
connect
500
Unknown
Color
shouldShow
built
hack
keypatterns
globally
Perform
hidden
cmdArray
process
PD
Displays
DocumentViewerPage
reused
viewport
UndefinedCharacterFormatException
visibleComponents
enabled
feature
timestamp
configuration
Converter
LinkedFile
AutoCompletionBinding
loadDatabase
OpenDatabase
Error
openoffice
super
outline
exporter"
Previous
callables
program
INITIAL_START
Process
remoteClient
overwrite
Always
Workaround
comparing
TreeSet
resolved
setGraphic
"unused"
resize
BufferedImage
showChoiceDialogAndWait
Date
(not
accept
AutoCompletionTextInputBinding
getRestartWarnings
textInput
keyBindingRepository
Removal
ObjectProperty
ask
BibtexString
guess
locally
removing
Prevent
NOT
DOES
ChangeScanner
such
TWITTER
Bootstrap
Google
FILE_POWERPOINT
Version
too
installed
stable
newer
ISuggestionRequest
callback
getGraphicNode
JabRefIcons
As
overwriting
Warning
GUIPostOpenAction
bottom
clipboardManager
MERGE_DATABASE
New
mainStage
LinkedFileViewModel
HTML
getNode
REMOVE_NODE_KEEP_CHILDREN
UndoableAddOrRemoveGroup
subtree
whole
backup
specialField
val
compare
BibDatabaseDiff
Start
Display
draggedItem
Dialog"
Edit
Control
got
sorting
match
TypedBibEntry
doi
nodes
option
mimeType
mime
Integer
Lib
Mr
consent
raisePanel
filesToOpen
BibEntryWriter
form
later
setWindowTitle
getBasePanelList
Libre
window
currentKey
TaskExecutor
DefaultTaskExecutor
Executor}
keyword
runInJavaFXThread
AllEntriesGroup
never
controls
conversion
defaults
ones
unchanged
Go
getId
removeString
pdf
Property
File}
executeAll
resulting
listening
@see
"Merge entries"
ButtonType
Name
define
UI
getParent
cmd
//
argArray
bootstrap
installation
UNO
Runnable}
per
paths
Column
returned
calculation
//stackoverflow
html
tabbedPane
workaround
Collections
Execute
cellData
cleanup
infrastructure
fit
commands
PushToApplication
editors
pushing
Extract
forms
binary
Redistribution
Controls
2014
onSuccess
successfully
Abbreviations
getInformation
statistics
Prints
formats
DocumentPageViewModel
reuse
individual
comparator
firstField
JabRefIcon
TableColumn
preferred
DO
getDeclaredField
arrow
GroupTreeNodeViewModel
getDesiredWidth
rendering
star
relative
FILE_MULTIPLE
Browser
JabRefAction
journalAbbreviationLoader
Double
"Mode MOVE"
Inserts
License
XML
Author
PersonNameSuggestionProvider
Hide
various
searching
jump
standard
Adapter
Mac
setGroup
starting
center
mustTestCharFormat
test
supposed
Xubuntu
setSelected
twice
none
An
dispatch
PreferencesTab
Preference
merge
Main
listeners
Effects
therefore
anyway
TableCell
Shift
watch
part
(i
shared
encoding
PersistenceVisualStateTable
columns
made
getPort
remotePreferences
REMOTE_LISTENER
alone
finish
give
very
it's
collect
Formatter
pairs
Hashtable
users
assignment
type's
ensureCorrectJavaVersion
versions
ProgressIndicator
indicator
importFormatPreferences
Parse
CleanupWorker
cleaner
cursor
again
Icon())
Theme
Icon(
color
language
(except
Converts
above
Be
validation
newerVersion
Root
Group(groups
actually
bibtexResult
might
Since
BIB_SECTION_NAME
Child
Provider
Suggestion
setPasteActionHandler
init
(if
UnlinkedPDFFileFilter
Filter}
anyMatch
override
going
getChildren
referring
those
go
sheet
Style
contain
Item
ProtectedTermsLoader
protectedTermsLoader
restore
dependent
properties
exportFactory
looks
Taken
DuplicateResolverResult
DuplicateResolverDialog
findInternalDuplicate
inspection
possibly
PseudoClass
jabRefFrame
showParserResultWarningDialog
AUX
sub
depend
dragboard
howToReproduce
"\n\n"
body
report
GroupHierarchyType
FieldChange
contained
"Mode Copy"
ctrl
bibliographic
fetching
compound
Bibtex
Duration
FadeTransition
smoother
KeyEvent
log
TimeUnit
library
poll
several
filter
getFile
executable
EYE
READ_STATUS
eye
Entry}
completions
Delivers
radio
getMainFrame
messages
LogEventViewModel
Event}s
replacing
multiple
Helper
Layouts
drops
immediately
BibDatabaseMode
entryRight
entryLeft
MergeEntries
optional
Constructor
storeSettings
appropriate
presses
Dir
AutoCompleteFirstNameMode
occur
Consumer
consumer
Consumer}
MappedList
RadioButton
detecting
toOpenTab
things
finally
dbFile
textFields
modification
temporal
PRINTED
Localization())
ContextMenuEvent
contextMenu
TextArea
showContextMenu
Area
sun
Note
^
afterOpening
beforeClosing
SidePane
Component}
JabRefLauncher
Launcher
setExpandableContent
won't
expandable
thinking
Fool
DialogPane
setDialogPane
supplied
details
hide/show
applyCss
grab
force
windows
"Display help on command line options"
"help"
"h"
addOption
WIDTH
FONT_SIZE
putInt
updateEntryEditorColors
colors
WIDTH_ICON_COL_RANKING
Ranking
Width
12
WIDTH_ICON_COL
improve
additional
Xlib
graphical
initializations
shortcuts
keyboard
graphics
variables
Static
stopAll
SDKShutdownActivity
JabRefException
startBackgroundTasks
getKeyPrefs
synchronized
initializes
Each
Remote
Manager
JournalAbbreviationLoader
Alert
FXDialog
visibleProperty
managedProperty
Nodes
visble
rendered
managed
pressed
EntryTypeView
choose
prompts
DragAndDropDataFormats
Format}s
Data
Contains
archivePath
showFileOpenFromArchiveDialog
lets
PrinterJob
showPrintDialog
These
printer
Allow
directoryDialogConfiguration
DirectoryDialogConfiguration
showDirectorySelectionDialog
showFileOpenDialogAndGetMultipleFiles
showFileOpenDialog
showFileSaveDialog
showProgressDialogAndWait
Clicking
Progress
canceable
showCustomDialogAndWait
<R>
cancelButtonLabel
red
showWarningDialogAndWait
yellow
defaultValue
showInputDialogWithDefaultAndWait
showInputDialogAndWait
Choice
DefaultInjector
setInstanceSupplier
Injector
construct
own
Dependencies
creates
By
care
CrossrefFetcherEvaluator
itself
Not
thresholds
improvements
algorithm
checking
Useful
"file"
"doi"
"url"
performSearch
getGlobalSearchBar
entries)
(found
IMO
AUTO_ASSIGN_GROUP
groups)
getAutoLinkPreferences
constructFromConfiguration
FileFinders
fileFinder
FileFinder
behind
asterisk
suggestionProviders
deactivated
changeFilter
sync
Ensure
baseChanged
resetChangeMonitorAndChangePane
outside
notifications
Monitor
getDividers
splitPane
valueAt
dividerPositionSubscription
subscription
keep
Saves
instantiateSearchAutoCompleter
adjustSplitter
Editors)
affects
creation
(before
splitting
these
setSelectedEntries
listEvent
replaced
(TODO
binds
setFocusToField
entryEditor
load)
(async
Focus
markBaseChanged
addEdit
getUpdateFieldPreferences
owner
copiedKeysAndTitles
"\\bibtexkey - \\begin{title}\\format[RemoveBrackets]{\\title}\\end{title}\n"
sr
exports
arbitrary
allow
future
copiedKeys
copiedCiteCommand
copiedTitles
selectedBibEntries
COPY_KEY_AND_LINK
urls
hyperlinks
copyCiteKey
COPY_CITE_KEY
copyTitle
COPY_TITLE
copyKey
COPY_KEY
PASTE
(doesn't
flavors
detection
robust
pasting
COPY
'*'
"*"
isAutosaveEnabled
isModified
changeFlag
GroupTreeListener
addition
Used
searchAutoCompleter
Completer
SHOWING_NOTHING
enums
instantiated
Keeps
SearchListener
Actual
updated
Let
AKA
setCurrentSearchQuery
basepanel
saveDividerLocation
preference
Depending
ensureNotShowingBottomPanel
Closes
entryEditorClosing
relay
clearAndSelect
scrolls
showAndEdit
setupAutoCompletion
runCommand
requested
Removes
outputFormat
CitationStyleOutputFormat
copyCitationToClipboard
Citation
desired
populated
incidentally
perceived
CPU
100%
unexpected
Binding
Key(
Prefs()
put(
Map()
Search"
"clear
theFile
formatters
exporting
database's
hasEncodingProblems
fileWriter
hasEntries
something
startupMode
Normally
endsWith
ENGLISH
toLowerCase
aLeftOver
bibExtension
interpreted
Leftover
getExporterByName
"tablerefsabsbib"
X)
(with
entered
" "
"\\$"
searchTerm
blank
stands
blanks
enables
importAndOpenFiles
database(s)
imported/loaded
isPreferencesImport
isPreferencesReset
": "
"Importing in unknown format"
format"
"guess
Download
fetchCommand
argument
importToOpenBase
File)
(like
getContents
Clipboard
residing
setContent
onto
operate
modes
Defines
AuxParserResultViewModel
print
rationale
ApacheCommonsLang3Allowed
fully
intention
explicitly
Lang3
Commons
Apache
Annotation
unavailable
oraclejdbdc6
distributable
stubs
OracleStatement
OracleDriver
Connection
OracleConnection
DatabaseChangeRegistration
DatabaseChangeListener
DatabaseChangeEvent
libreoffice
thirdparty
Construct)
Post
(@
Annotations
desktop
compatibility
backwards
AutoLinkFilesAction
Never
FOLDER_OUTLINE
OPEN
unit
schedule
becomes
shot
Submits
setWidth
correct)
(recalculate
hide
getLocalization
allParams
setted
special
multi
"-fx-padding: 0.5em 0 0.5em 0;"
setStyle
5em
below
align
"zxx"
"CharLocale"
setPropertyValue
xCursorProps
None]
rather
quotePath
strings
explorer
quote
"Cite"
citePressed
progressProperty
getLoadWorker
getEngine
loaded)
70%
(over
reasonable
stripped
getPageNumber
selectedFieldName
correctly)
(run
Restore
getTypeIcon
External
externalfiletype
infer
smarter
bit
About"
shouldShutDown
handleMultipleAppInstances
Bibliography
manipulating
"autoCompletionPopup"
privatePopup
cleanUpMovePDF
regardless
So
getMetaData
metaData
MetaData
Cleanups
bibliography
inserts
NAMES_NATBIB
namesNatbib
MK
isMatch
suggestion)
(is
KEEP_MERGE
answer
boxes
setSaving
release
updateMergedEntry
editAbbreviation
Abbrevaition
xTextContent
"Field"
asList
Arrays
columnHeadings
Headings
getSuffix
continue
ignore
May
typeProperty
subscribe
typeSubscription
rebuilding
Subscribe
terminates
Tests
footnote
linking
getPreviewPreferences
previewPreferences
PreviewPreferences
(citation/preview)
what
behave
submenu
updateFieldPreferences
owner/timestamp
AutosaveUIManager
Event}
listens
role
visual
dataBaseNumber
xUrlResolver
bindToEntry
certain
groupType
configure
CustomizeExternalFileTypesDialog
FindFullTextAction
entry(ies)
fulltext
download
entriesList
OtherFieldsTab
entryEditorTabs
openTheFile
CheckForNewEntryTypesAction
offer
nextOperation
thenRun
"-"
replaceAll
linebreaks
hyphens
newlines
getToAdd
nameChange
visualizer
fieldFormatterPreferences
LatexFieldFormatter
legally
Test
Group(parent
getDefaultKeyBinding
key(s)
call()}
concurrent
MAGNIFY
LOOKUP_IDENTIFIER
ADD_NODE
(group)
Adding
massRenameField
m_subtreeRootChildCount
keeping
helpButtonContainer
getCurrentSearchQuery
newBasePanel
activeSearchQueryProperty
switching
VIEW
KeyBindingCategory
"ctrl+MINUS"
ENTRY_EDITOR_PREVIOUS_PANEL_2
decrease
"Steps to reproduce:\n\n1. ...\n2. ...\n3. ..."
reproduce
Steps
uniquefy
Remember
runLater
Platform
Must
currentFile
notifyNewSelectedFile
switched
Pretend
setupAllTables
Dialog3
Prefs
anew
tables
Panels
causes
'/'
indexOf
strippedLinkIndex
substring
strippedLink
definitely
separators
occurrence
installedVersion
pathname
Except
Model)source
Change(((
Scene
installCss
stylesheet
strategy
identicalTypes
Text(priority
OpenDatabaseAction
Result
Parser
imports)
Reader
here)
parserwarnings
Makes
AbstractViewModel
ManageJournalAbbreviationsViewModel
modify
necessary
postUndoRedoEvent
trigger
Send
index
Resolve
ABBREVIATED"
Bob"
Smith
full
FULL"
FileFilter
Entry}s
excep
enough
CitationStyleToClipboardWorker
copied
preview)
contextMenuProperty
items)
(only
couldNotCall
"JabRef"
FRAME_TITLE
btn
bindable
rework
mvvm
Messages}
forwarded
xNamed
Enrich
tearDownJabRef
bye!
Good
POSITIVE_INFINITY
setPrefHeight
fill
ContentSelectorSuggestionProvider
Enriches
his
"javafx.scene.control.TableUtil"
forName
copySubtree
newNode
Enabled(event
Description())
DESCRIPTION
SHORT
Value(
{undo
Later(()
invoke
Utilities
refreshCiteMarkers
MrDLibFetcher
getRelatedArticleInfo
Related
Stack
Box
entriesFiltered
SortedList
entriesSorted
getFields
addAll
treat
UnlinkedFilesCrawler
Database}
rely
Rework
clicks
DroppingMouseLocation
occurs
gesture
dropping
mouse
Preferences())
Layout(preferences
entry")
Jump
toolitp
Implement
indicated
Holds
valInNewField
stack
CommandBase
DatePicker
TemporalAccessorPicker
datetime
picker
pathToNewParent
getDescendant
newParent
Null
RelatedArticlesTab
recommendations
Updated
clearPassword
password
comp
SidePaneComponent
moveDown
Moves
MultipleSelectionModel
NoSelectionModel
Disables
Empty
getObservables
newEntry
correctEntries
received
ANY
MouseEvent
addEventFilter
navigating
disable
Quick
getIconUrl
Looks
TreeTableCell
TreeTableColumn
ViewModelTreeTableCellFactory
EventListener
OpenHyperlinksInExternalBrowser
<a
adapted
Code
Web
Click
Hyperlink
"pushing"
interaction
targetPath
saveDatabase
success
getBookmarkRange
hadBibSection
computed
mocked
EntryEditorTabList
customizable
getEntryEditorTabList
entryEditorPreferences
imported
invalidate
anySelectedEntriesMatched
xLocalContext
local
putValue
concrete
filesToSerialize
serialize
HelpAction
activated
keeps
generateKeys
basic
SINGLE
annotationList
getFilePreferences
getFileDirectories
toFile
PreferredIndexSort
ALL
IEEETranEntryTypeDefinitions
"IEEETran"
populateSubMenu
Tran
IEEE
processPreview
(WYSIWYG
additionally
plain
";urp;StarOffice.ComponentContext"
"uno:socket,host=localhost,port=2083"
OS
sequence
TableRow
ViewModelTableRowFactory
'a'
unique
appears
ReadOnlyStringWrapper
Ignore
ENTRIES))
MARKED
FLOAT
State(
Marking
Float
EntryEditor
fontBox
m_editType
CHILDREN)
CHILDREN
KEEP
(ADD
xContext
getDefaultEncoding
importDatabase
Specific
num
count
sorted
Font)
Font(GUI
"com.sun.star.comp.connections.Acceptor"
acceptor
us
groupsRoot
operationCompleted
Entries()
push
etc
Reporting
EPRINT
Xiv
Ar
UndoRedoEventManager
Decide
getMergeEntry
Merged
propagation
<=
isModifiedLocally
well
UndoableRemoveEntry
readIconThemeFile
fileLink
openFolderAndSelectFile
mouseLocation
constructed
indirectly
entryNumber
ExporterFactory
ThemeLoader
turned
createOptionsExplicitGroup
explicitPanel
cards
Build
400
ofMillis
FxTimer
searchTask
Timer
publishing
"com.sun.star.comp.loader.JavaLoader"
BibtexKeyPatternPanel
BibtexKeyPatternPrefTab
Template
getDroppingMouseLocation
ControlHelper
Asks
'='
escaping
typical
searchButtonClicked
recursive
getSelectedGroup
addToGroups
previously
Here
FILE
file"))
FILE_FIND
AUTO_FILE_LINK
Location(this
pw
Location
Bounds())
Maximum
Environment()
Local
Environment
Bounds(
automatedImport
hasNext
Iterator
char
valueOf
benefit
getNameMenu
rules
Tex
regarding
person
normalizing
Name()))
file"
%0
getKeyPatternAsGlobalBibtexKeyPattern
GlobalBibtexKeyPattern
getImageFX
Image}
writeOrCreate
getAbbreviation
journalAbbreviationRepository
getStringArrayRepresentation
storage
printedViewModel
CROSSREF
clonedEntry
cloned
GROUPS_DEFAULT_FIELD
keywordGroupSearchField
null)
(overwritten
<filename>"
"open
<application>"
newDatabase
onActiveDatabaseChanged
getSelectorPanel
GridPane
comboboxes
Merge
onSelectedGroupChanged
PasteActionHandler
Handler
getOpenDatabaseAction
raising
threads)
Responsible
FieldChangeViewModel
fieldChanges
externally
Modified
isGeneratedNameSameAsOriginal
suggested
compares
startSearch
unlinked
Starts
NewSubLibraryAction
latex
)database
(sub
entry))
Database()
Entry(panel
getExternalFileTypeByName
"' because the name "
"' to '"
"Cannot rename string '"
comply
point
PDF")
Too(
FunctionalInterface
applying
behaviour
described
presents
Interface
m_modifiedSubtree
remember
rename
Cannot
defTypes
hasn't
figure
intelligent
hit
calculate
showingProperty
times
few
gets
ok
validProperty
formValidation
disableProperty
btnConnect
still
firstEntry
normCitMarkers
normalized
10
contextPanel
Doc}
{@inherit
BUILD_INFO
buildInfo
BuildInfo
getCommandName
inMiddleOfViewport
pattern
bps
targetEntry
bestFit
zero
score
fitting
best
Finds
saveEverythingAndUpdateAutoCompleter
writes
sense
clearSuggestions
removedNode
AppearancePrefsTab
Customization
"Autogenerate BibTeX keys"
Ses
addNewSubgroup
nextTaskFactory
getLogMessagesAsString
separator
formatted
Concatenates
get("lyxpipe")
"asdf"
fixed
hyperlink
expand()
Expand
frame()))
Group()
Node()
Effects(node
Bar}
Section
LAST_USED_EXPORT
become
pref
strip
Binding}
Completion
Abbreviation))
Name()
Change(entry
Manager()
overwriteKeys
once
graph
toAdd
showNode
getSource
yes
Are
ExplicitGroup
explicit
nature
detailing
GraphicValidationDecoration
IconValidationDecorator
Decoration}
Validation
Graphic
similar
getBibtexKeyPatternPreferences
jabRefPreferences
BibtexKeyPatternPreferences
viewed
CHECKBOX_MARKED_CIRCLE_OUTLINE
PLAIN_TEXT_IMPORT_DONE
priorityViewModel
Priority
searchField
cause
saveExternalFilesList
stores
TagBar
combobox
pre
successful
irrespectively
openBrowserShowPopup
instruct
fails
excel
contact
bindContentBidirectional
undoEdit
makeChange
Compound
responsible
Performs
Inform
ITALIC_ET_AL
getBooleanCitProperty
al
"et
container
together
constants
Global
"Metadata change"
"<html>"
Builder(
Builder
detailed
MergeReviewIntoCommentAction
Comment
Review
migrating
Migrations
ind
piv
txt
stringBuilder
s2
s1
populateTable
models
repository
keybindings
initialField
initialLink
openExternalViewer
http/pdf/ps
updateSortedReferenceMarks
uniqiefiers
numbering
account
buildFromArgs
Construct
"setupClearButtonField"
getDeclaredMethod
TextFields
Status
Added
setIconName
tabNumber
getType
originalEntry
oldType
originalFields
"Unable to save library"
unsuccessful
setProgressBarIndeterminate
indeterminate
CreationException
applyPreferences
respectively
configures
Fetches
shutdown
executorService
setWorkingDir
MULTIPLE
groupTree
cache
annotation/cache
reinitialize
annotations
".in"
in"
helps
getAnchor
anchor
footnote's
createSimpleServiceManager
XMultiServiceFactory
Manager</code>
Service
<code>com
UNOIDL
servicemanager
setupKeyBindings
getDisplayText
directory)
(and
isNull
selectedKeyBinding
117
204
111
rgb
READ_STATUS_READ
injected
(otherwise
reasons
performance
ourselves
decoration
taking
openBrowser
MODIFY"
"ENTRY
nameField
Item(
Layout
refactoring
Needs
anymore
Deleted
selectDocument
Connect
Enable
ReferenceViewModel
activeReferenceChanged
DEFAULT_BIBTEX_KEY_PATTERN
createBooleanBinding
streams
'true'
contrast
(in
permutedPart
Event
leftEntry
setField
mergedEntry
ManageProtectedTermsDialog
BOTH)
MAXIMIZED
State()
Extended
MAXIMISED
WINDOW
StringProperty
UiThreadStringProperty
selectEntryList
isExistURLorDOI
generateImage
Height()))
Width()
Image(get
Writable
Image(new
pipe
socket
NoDocumentException
WARNING_LIMIT
minimum
BackupUIManager
Backup
Stores
futures
exact
seen
VIEW_LIST
TOGGLE_GROUPS
nameToFormat
getIntegerTextFormatter
TextFormatter
integers
restricts
formatter
(=
min
longer
ms
Wait
UnknownExternalFileType
CLOSE_CIRCLE
RED
INTEGRITY_FAIL
consume
toBeRemoved
URL_EXP
decode
addBuiltInLists
ieee
ConnectToSharedDatabaseCommand
getApplicationDirectory
applications
system's
currentTimeMillis
dragStarted
collapse
shift
isEnabled
fieldFormatterCleanups
EnablementStatusListener
selectedProperty
cleanupEnabled
TransformationList
Mapped
m_groupRoot
putKeyPattern
patterns
ValueTableCellFactory
runMigrations
PreferencesMigrations
migrations
being
getFiles
Fs
Make
exec
getRuntime
Runtime
StringUtil
vals
getCount
pages
Page
neat
apparently
There
localDate
TemporalQueries
dateTime
LocalDate
accessor
much
exit
now
Saved
InvalidationListener
PreviewViewer
gotoRange
xViewCursor
back
textToSet
massSetField
Cell
Page}
Viewer
Document
openExternalFilePlatformIndependent
CurrentThreadTaskExecutor
sequential
Implementation
charStyle
Setting
UpdateTimestampListener
updateFont
recent
Repaints
externalFileTypesFile
fileDirectories
fromFile
Linked
slightly
diskdb
"'
'"
writing")
Hierarchies
xhtml
Dev
Dev/
Guide/
Developers
org/docs/
//api
60000
minute
putBibEntries
bibEntries
Link
Parsed
cast
ResizeFeatures
SmartConstrainedResizePolicy
POLICY}
RESIZE
CONSTRAINED
almost
policy
LABEL_OUTLINE
OPTIONAL
getMessage
ex
ConnectionLostException
functionalities
"modify
"add
newFile
moved
merely
"&"
extract
meantime
somehow
importStrings
importEntries
openIt
locking
"_def"
CUSTOM_TAB_NAME
args
sendCommandLineArguments
customTextField
CustomTextField
setupClearButtonField
externalFileTypes
propertyB
updateA
2015
Children
OBSOLETE_TYPE_HEADER
TYPE_HEADER
Utils}
itemsProperty
fileChoice
newHeight
newWidth
img
com/a/9417836/873661
"Select document"
selectedDocument
DocumentTitleViewModel
autodecting
toTemporalAccessor
parse
specified)
dates
kinds
restart
require
headings
getDefaultMenu
conversions
doing
changing
functions
SaveDatabaseAction
operations
as"
Save"
Sources
Command
especially
allBases
rebuildBibTextSection
getEntryByKey
resultDatabase
VersionWorker
worker
REMOVE_NODE_AND_CHILDREN
CLOUD_UPLOAD
CONNECT_DB
upload*
cloud
glyph
IconTheme
(e
FXML
IDE
needed
getChangeEntryTypePopupMenu
ChangeEntryTypeMenu
typeMenu
structure
Initializes
leftString
Left
getPrivacyDialog
permission
bs
renamed
Dragboard
acceptableDrop
droped
Dragboard}
Decides
bibDatabases
focusedFile
one)
(we
marking
textToAppend
massAppendField
Append
referenceFile
scanner
notable
setOnDragDetected
Drag
twitter
bootstrap_parameters
ini_file
defaultBootstrap_InitialComponentContext
Context()</code>
Initial
<code>cppuhelper/default
native
AUTO_FIX
AUTO_GROUP
fix*
keywordsToRemove
removeAll
"^https?://(?:www\\.)?google\\.[\\.a-z]+?/url.*"
GOOGLE_SEARCH_EXP
Detect
powerpoint
manualExecution
showConnectionError
manually
problem
getNewVersion
unstable
except
excluding
O(n)
complexity
Databases
GROUP_INTERSECTION
node/icon
concept
"com.sun.star.comp.connections.Connector"
connector
ApplicationInsightsEvent
ApplicationInsightsLogEvent
compatible
AI
dontOverwrite
warnBeforeOverwriting
potential
getFileName
mixed
ps
PasswordField
maskText
"A")
Text("A")
(mask
although
initiate
necesary
basePath
pathToClass
setProgressBarVisible
visibility
xChildSection
Section's
Access
extractData
entriesToAdd
CODE_EQUAL
FIND_DUPLICATES
OldDatabaseCommandWrapper
StandardActions
createMenuItem
getTreeItem
expandGroup
dragExpansionHandler
zipFile
FileSystem
ZipFileChooser
chooser
ZIP
post
isBlank
getParserResults
getEntry
linkedFiles
linkedFileViewModel
processHtml
editedNode
editType
nullFieldIfValueIsTheSame
updateField
SpecialFieldsUtils
value==null
updatefield
omitted
(value==null)
getMergedEntry
diag
loopDatabase
Loop
changedGroups
it'll
though
databaseOnDisk
referenceDatabase
differences
looking
moreLink
isExpanded
setExpanded
expansion
leave
parseRefMarkName
monitor
oldGroup
editGroup
getLink
linkedFile
"Could not find file '%0'."
"File not found"
handled
notifyAboutFocus
Notifies
updateExternalFileTypes
recorded
trying
preset
CleanupPreset
doCleanup
records
cEntries
getMode
typedEntry
CopyDoiUrlAction
getConstant
constant
SERVER_PLUS
ADD_ROW
plus*
getFileListFromNode
structure)
(leaf
defaultApplicationSelectedProperty
Default"
charge
free
granted
hereby
Permission
MIT
Corporation
Microsoft
Insights
4b
Up
m_pathToNode
subtree's
getExtensions
getFileType
extensionString
get(0)
gotten
extensions
isMrdlibAccepted
openFiles
happens
404
bibtexEntryWriter
email
sw
moveTo
UndoableChangeType
ManageJournalAbbreviationsView
ui
selectedEntries
delta
sqrt
Math
getWidth
desiredPageDimension
setPageWidth
ratio)
aspect
A4
Assuming
currentPage
missed
Heuristic
DetectOpenOfficeInstallation
installations
Tools
ENTER
KeyCode
getCode
react
separate
submitted
Every
leads
ensures
approach
intersection
remaining
linkSourceBase
findCitedEntries
Source
redefined
Although
KEY_FIELD
KEY_RELEASED
addEventHandler
tableView
menu"
"context
Activate
"Search"
triggers
paranoia
FetchAndMergeEntry
merging
ActionFactory
updateAllTabTitles
visibleTabs
present)
Next
validator
mvvmfx
xmpEntriesInFile
xmp
stopRemoteThread
kill
forUI
posts
sortedReferenceMarks
deleteAbbreviation
selectLastJournalFile
Model}
UiThreadObservableList
stamp
Time
OK_DONE
ButtonData
ButtonBar
replaceEntries
With
updateAfterPreferenceChanges
Reloads
"xdg-open "
"Mode COPY"
Ctrl
filePreferences
getFirstExistingFileDir
fileDir
Entry()
}final
Enabled())
Sync
Keyword
BootstrapException
URLClassLoader
JabRefMain
runAndWaitInJavaFXThread
waits
FX_FONT_RENDERING_TWEAK
improved
blurry
fonts
Linux
createFileObjects
groupNode
updateColumnPreferences
keyBinding
imlement
isResolved
field(s)
Value()
requiresBibtexKeys
getTabTitle
getBasePanelAt
getTabs
(again)
focusPanel
addParserResult
JabRefDesktop
platform
supported
api
com/questions/18004150/desktop
Desktop
com/javase/7/docs/api/java/awt/
//docs
CLIPBOARD_ARROW_LEFT
EXPORT_TO_CLIPBOARD
textField
SimpleObjectProperty
OptionalObjectProperty
Value}
Monadic
easybind
fxmisc
Similar
getSkin
TabPaneSkin
tabHeaderArea
header
expandtab
softtabstop=4
shiftwidth=4
vim
un/abbreviate
isExternalFileTypeByExt
emptyList
Ignored
setCellValueFactory
getCleanupURLMenu
AbstractPushToApplication
UndoableFieldChange
updateView
reflect
destination
2016
saveJournalAbbreviationFiles
Create()}
Calls
includeMissingEntries
parsing
exist")
lang("PDF
redraw
propagate
place
mechanism
ConversionMenu
converting
"Node LINK"
alt
userSpecificFileDirectoryProperty
vars
'dir'
'text'
Repeat
emptyKeys
getComparator
secondField
createUrlOrDoiColumn
BibEntryTableViewModel
Field}
Ls
UR
Is
"contentWidth"
privateStringField
ARROW_UP_BOLD
MOVE_TAB_ARROW
bold
isFormatCitations
started
ListChangeListener
onDatabaseChanged
m_groupsRootHandle
initParameters
expected
getDesiredHeight
Rectangle
loading)
(for
STAR_CIRCLE
RELEVANCE
"soffice"
"soffice.exe"
"Windows"
startsWith
"os.name"
getProperty
sOffice
class's
RESOLVE_STRINGS_ALL_FIELDS
resolveStringsAllProperty
Flipped
convert
Wrapper
dialogTitle
abbreviationsPreferences
addImportedEntries
decide
let
columnWidths
Properties
computeHighlighting
StyleSpans
Clause
BSD
@cemartins)
(github
Martins
Carlos
Codearea
Rich
Highlighting
Syntax
Author}s
setWrapText
scrollbar
horizontal
OptionEditorViewModel
MapBasedEditorViewModel
backed
150
setPrefWidth
currentResults
searchbar
hinders
entries"
"found
fits
quit
Cmd
Quit"
getAllEntriesGroup
DefaultGroupsFactory
think
openConsole
Globals}
console
getBoundsInParent
anchorBounds
Bounds
MassSetFieldsAction
Defaults
Functionality
mass
launching
dummy
keyString
pushEntries
extend
Tab
building
scrollY
estimatedScrollYProperty
flow
Bidirectional)
keywords)
(modifies
effects
undesired
getContext
hierarchical
keywordGroupRegExp
disabled
would
regex
JournalAbbreviationsNameTableEditingCell
editable
tooltips
"jar"
cssUri
bundle)
ordinary
absolutePath
"%DIR"
isShared
encodingDisableProperty
UTF
resizing
reordering
Keep
JabRefMessageHandler
openAndStart
closeBottomPane
better
WaitForSaveFinishedDialog
closing
maybe
situation
exceptional
Edit(target
Of
Assignment(
conclude
Selector
Empty())
(!undo
ListCell
ListView
ViewModelListCellFactory
UnknownFormatImport
ImportFormatReader
caseChangers
changer
calling
iterate
easier
convenience
jni
beginning
spaces
enable
TITLE)
Title(FRAME
appended
getIconName
unsupported
Fail
getImportFormatPreferences
ImportFormatPreferences
UndoablePreambleChange
InputMethodRequests
InputMethodRequestsObject
Work
getCleanupPreferences
collapseToEnd
overwritten
ADVANCED
toolTipText
displayName
SearchDisplayMode
reflected
localized
supplier
getDefaultBibDatabaseMode
getDefaultContextMenuItems
undo/redo)
getPushToApplicationAction
pushToApplicationsManager
pushToApplicationAction
PushToApplicationAction
Push
processRtf
RTF
PAPERCLIP
ATTACH_FILE
paperclip*
filechooser
accepted
all!
lines
possibleSuggestions
keyPattern
AbstractBibtexKeyPattern
Fills
OPEN_IN_APP
CONNECT_OPEN_OFFICE
happy
validSettings
hasByName
xNamedBookmarks
retrieve
matchWithTmp
double
tmpfile
Compare
toBeIgnored
automated
ignored
respect
Model(new
addNewFile
shall
mergeImportResults
gather
Then
setName
Section'
sections
SuggestionProviderString
TrimWhitespaceFormatter
CleanupURLFormatter
pasted
targetDirectory
addLinkedFileFromURL
linked)
attaches
ff
searchDirectory
Unlinked
recursively
Searches
performAction
Necessary()
hasCiteKey
parallelStream
we're
"%s "
createText
TooltipTextUtil
textFlow
expression
advanced
describe
MAX_AUTHORS_FIRST
getIntCitProperty
maxAuthorsFirst
Finally
setCurrentAbbreviationNameAndAbbreviationIfValid
Name}
Abbreviation}
Rule(BODY
Sheet()
Kit())
Kit)
((HTML
Sheet
TYPE)
Type(CONTENT
menuItem
getAssociatedNode
Container
getProtectedTermsPreferences
terms
Initialize
generateSharedDatabaseID
SharedDatabasePreferences
ID
getExporters
matcher
REMOTE_LINK_PATTERN
height
render
KEEP_RIGHT
Second
previewLayouts
PreviewLayout
putPreviewLayouts
Layout}
joint
Selected
triggered
critical
getting
Don't
"root"
getPseudoClass
rootPseudoClass
deep)
classes
FromAuxDialog
generating
wizard
importButtonClicked
CustomLocalDragboard
safe
Placeholder
singleton
"Paste your log details here."
systemInfo
issueBody
Bug
INDEPENDENT
unlikely)
highly
addEntriesToGroup
node's
CompoundEdit
addGroups
Groups
child
fetcherMenu
getKeyBindings
SortedMap
Hash
replaceItem
Does
getSearchDescriberFor
SearchDescriber
describer
RSS
BLOG
rss
imageView
millis
fadeIn
transition
Fade
setPreamble
evt
setNewBinding
clearLog
Clears
MILLISECONDS
dups
completely
analyzed
timeout
FieldsEditorTab
Editors
holding
getAbsolutePath
Define
ObjectBinding
other}
held
holds
EditAction
general
handling
addAbbreviation
sets
BibEntrySuggestionProvider
identicalFields
identical
getDialogService
copyLog
replacements
...
TextReplacement
formatToTexts
characteristics
parts
Texts
Formats
Some
setShowOnFocus
autoCompleter
present
headingRight
headingLeft
captions
nameAccess
getSortedReferenceMarks
footnotes/tables
BOTH
Firstname
diskEntry
modificationsAgree
possibility
(unlikely
Another
getDatabaseFile
db
removeAllChildren
Root()
Subtree(get
Subtree
onException
onFailure
mapBacked
mapping
converted
element
"Generate groups from keywords in a BibTeX field"
autoGroupKeywordsOption
FileUpdateMonitor
DefaultFileUpdateMonitor
notifies
Upon
monitors
".tmp"
"jabrefCb"
createTempFile
afterwards
normal
API
simplify
isLoaded
bib"
somefile
"jabref
parsed
Already
seems
NET
identity
domain
Username
entrySet
INFORMATION
INTEGRITY_INFO
confirmClose
temporalAccessorValue
valueProperty
bindBidirectional
Accessor
Synchronize
Text(printed
Context
Requested(javafx
Behavior
behavior
com
@impl
</S>